In [1]:
import pandas as pd
import numpy as np

In [2]:
file = "/Users/ryotayamaoka/Desktop/kpmg_mod2/NewCustomerList.csv"
df = pd.read_csv(file)

In [3]:
df.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,...,QLD,Australia,6.0,0.92,1.150,1.4375,1.221875,1,1,1.718750
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,...,NSW,Australia,11.0,0.52,0.520,0.6500,0.552500,1,1,1.718750
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,...,VIC,Australia,5.0,0.68,0.680,0.6800,0.680000,1,1,1.718750
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,...,QLD,Australia,1.0,0.50,0.625,0.6250,0.625000,4,4,1.703125
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,...,NSW,Australia,9.0,0.98,0.980,1.2250,1.225000,4,4,1.703125

In [4]:
df.dtypes

first_name                              object
last_name                               object
gender                                  object
past_3_years_bike_related_purchases      int64
DOB                                     object
job_title                               object
job_industry_category                   object
wealth_segment                          object
deceased_indicator                      object
owns_car                                object
tenure                                   int64
address                                 object
postcode                                 int64
state                                   object
country                                 object
property_valuation                     float64
Unnamed: 16                            float64
Unnamed: 17                            float64
Unnamed: 18                            float64
Unnamed: 19                            float64
Unnamed: 20                              int64
Rank                                     int64
Value                                  float64
dtype: object

In [5]:
#  clean up data

In [6]:
df['DOB'] = pd.to_datetime(df['DOB'])

In [7]:
df = df.loc[:, ~df.columns.str.contains('^Unnamed')]

In [8]:
df['property_valuation'] = df['property_valuation'].astype('int')

In [9]:
df.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,14,45 Shopko Center,4500,QLD,Australia,6,1,1.718750
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,16,14 Mccormick Park,2113,NSW,Australia,11,1,1.718750
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,10,5 Colorado Crossing,3505,VIC,Australia,5,1,1.718750
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,5,207 Annamark Plaza,4814,QLD,Australia,1,4,1.703125
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,19,115 Montana Place,2093,NSW,Australia,9,4,1.703125

In [10]:
df.dtypes

first_name                                     object
last_name                                      object
gender                                         object
past_3_years_bike_related_purchases             int64
DOB                                    datetime64[ns]
job_title                                      object
job_industry_category                          object
wealth_segment                                 object
deceased_indicator                             object
owns_car                                       object
tenure                                          int64
address                                        object
postcode                                        int64
state                                          object
country                                        object
property_valuation                              int64
Rank                                            int64
Value                                         float64
dtype: object

In [11]:
df['gender'] = df['gender'].str[0].str.upper()

In [12]:
df['gender'].value_counts()

F    513
M    470
U     17
Name: gender, dtype: int64

In [13]:
df['past_3_years_bike_related_purchases'].value_counts()

60    20
59    18
70    17
42    17
37    16
      ..
19     5
9      5
92     5
85     4
20     3
Name: past_3_years_bike_related_purchases, Length: 100, dtype: int64

In [14]:
df['DOB'].value_counts()

1961-07-31    2
1994-04-15    2
1987-01-15    2
1951-11-28    2
1979-07-28    2
             ..
1947-04-21    1
1995-10-10    1
1964-08-23    1
1962-05-12    1
1958-04-21    1
Name: DOB, Length: 958, dtype: int64

In [15]:
df['job_title'].value_counts()

Associate Professor             15
Environmental Tech              14
Software Consultant             14
Chief Design Engineer           13
Assistant Media Planner         12
                                ..
Budget/Accounting Analyst I      1
Computer Systems Analyst III     1
Accountant II                    1
Accounting Assistant II          1
Administrative Assistant I       1
Name: job_title, Length: 184, dtype: int64

In [16]:
df['job_industry_category'].value_counts()

Financial Services    203
Manufacturing         199
Health                152
Retail                 78
Property               64
IT                     51
Entertainment          37
Argiculture            26
Telecommunications     25
Name: job_industry_category, dtype: int64

In [17]:
df['wealth_segment'].value_counts()

Mass Customer        508
High Net Worth       251
Affluent Customer    241
Name: wealth_segment, dtype: int64

In [18]:
df['deceased_indicator'].value_counts()

N    1000
Name: deceased_indicator, dtype: int64

In [19]:
df['owns_car'].value_counts()

No     507
Yes    493
Name: owns_car, dtype: int64

In [20]:
df['tenure'].value_counts()

9     79
13    74
11    68
10    63
12    61
7     60
5     60
17    59
15    58
8     55
14    54
16    49
6     45
18    36
4     36
19    34
3     26
21    24
20    22
2     15
22    12
1      8
0      2
Name: tenure, dtype: int64

In [21]:
df['address'].value_counts()

660 Carey Avenue            1
72 Mccormick Circle         1
7523 Eggendart Hill         1
1 Mandrake Way              1
30 Harper Trail             1
                           ..
22580 Doe Crossing Drive    1
1 Fordem Way                1
540 Farragut Avenue         1
276 Westend Road            1
2 Mandrake Street           1
Name: address, Length: 1000, dtype: int64

In [22]:
df['postcode'].value_counts()

2232    9
2145    9
2168    7
2750    7
3029    7
       ..
4408    1
2151    1
4159    1
3121    1
3051    1
Name: postcode, Length: 522, dtype: int64

In [23]:
df['state'].value_counts()

NSW    506
VIC    266
QLD    228
Name: state, dtype: int64

In [24]:
df['country'].value_counts()

Australia    1000
Name: country, dtype: int64

In [25]:
df['property_valuation'].value_counts()

9     173
8     162
7     138
10    116
6      70
11     62
5      57
4      53
3      51
12     46
2      42
1      30
Name: property_valuation, dtype: int64

In [26]:
df['Rank'].value_counts()

760     13
259     12
455      9
904      9
386      9
        ..
785      1
773      1
754      1
355      1
1000     1
Name: Rank, Length: 324, dtype: int64

In [27]:
df['Value'].value_counts()

0.637500    13
1.062500    12
0.900000    11
0.945625     9
0.892500     9
            ..
1.155469     1
0.501500     1
0.535500     1
0.818125     1
0.799000     1
Name: Value, Length: 319, dtype: int64

In [28]:
dict = {'New South Wales': 'NSW', 'Victoria': 'VIC', 'Queensland': 'QLD'}

In [29]:
df['state'] = df['state'].replace(dict)

In [30]:
df['state'].value_counts()

NSW    506
VIC    266
QLD    228
Name: state, dtype: int64

In [31]:
df.to_csv('cleaned_new_customer_list.csv')

In [32]:
df.describe()

,past_3_years_bike_related_purchases,tenure,postcode,property_valuation,Rank,Value
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,49.836000,11.388000,3019.227000,7.397000,498.819000,0.881714
std,27.796686,5.037145,848.895767,2.758804,288.810997,0.293525
min,0.000000,0.000000,2000.000000,1.000000,1.000000,0.340000
25%,26.750000,7.000000,2209.000000,6.000000,250.000000,0.649531
50%,51.000000,11.000000,2800.000000,8.000000,500.000000,0.860000
75%,72.000000,15.000000,3845.500000,9.000000,750.250000,1.075000
max,99.000000,22.000000,4879.000000,12.000000,1000.000000,1.718750

In [33]:
df.corr()

,past_3_years_bike_related_purchases,tenure,postcode,property_valuation,Rank,Value
past_3_years_bike_related_purchases,1.000000,-0.034183,0.015208,-0.010833,-0.004392,0.004884
tenure,-0.034183,1.000000,0.030573,-0.014913,0.005546,-0.012257
postcode,0.015208,0.030573,1.000000,-0.496725,-0.050190,0.055851
property_valuation,-0.010833,-0.014913,-0.496725,1.000000,0.016385,-0.014700
Rank,-0.004392,0.005546,-0.050190,0.016385,1.000000,-0.984093
Value,0.004884,-0.012257,0.055851,-0.014700,-0.984093,1.000000